const DUMMY_DATA = [{
    id:'fig1',
    title:"سید محمود دعایی",
    image:"figure1.jpg",
    description:"اصغر صوفی: نه در حرف و شعار که در عمل به ملزومات میانه‌روی، عقلانیت و اعتدال پایبند است؛نامش با روزنامه «اطلاعات» پیوند خورده است و نام این روزنامه هم با نام وی. سیدمحمود دعایی،بهترین توصیف را درباره خود بیان می‌کند: «من دیرپاترین مسئولی هستم که در این نظام تحمل شدم.",
    isFeatured:false,
  },
  {
    id:'fig2',
    title:"قاضی احمد مظفری",
    image:"figure2.jpg",
    description:"قاضی احمد مظفری، قاضی دادگاه اطفال بود که نامش از سال78 و به‌خاطر مجازات‌هایی که برای کودکان بزهکار درنظر می‌گرفت بر سر زبان‌ها افتاد. فردی که بی‌شک تأثیر فراوانی در سرنوشت صدها و شاید هزاران بزهکار نوجوانی که خطر حبس و تأثیرات ناشی از آن تهدیدشان می‌کرد گذاشت و اجازه نداد چنین خطری آینده آنها را تهدید کند.",
    isFeatured:true,
  },
  {
    id:'fig3',
    title:"محمدحسین ماندگار",
    image:"figure3.jpg",
    description:"دکتر ماندگار از چهره های ماندگار مهارت در جراحی پیوند قلب را در سال‌های متمادی و در شهرهای مختلف دنیا به‌دست آورد.وی این دوره را ابتدا در سال۱۹۸۸ درلوزان، سپس در سال۱۹۹۰ در پاریس و بعد در سال ۱۹۹۱ در لندنو در نهایت در سال ۱۹۹۲ در وین گذراند",
    isFeatured:true,
  },
  ]
  export function getFiguere(){
      return DUMMY_DATA.filter((figure) => figure.isFeatured)
  }
  export function getAllFigures(){
      return DUMMY_DATA
  }
 export function getFacesById(id){
   return DUMMY_DATA.find((face) =>  face.id === id)
 }