const DUMMY_DATA = [
  {
    id: "fig1",
    title: "سید علی ملک ‌حسینی",
    image: "Malek_Hosseini.jpg",
    face: "چهره های ماندگار: پزشکی و علوم تجربی",
    birthday: "روز تولد: 1310/5/16",
    description:
      "جراح و عضو هیئت علمی دانشگاه علوم پزشکی شیراز است.او نخستین پیوند کبد در ایران از فرد زنده به زنده را انجام داد و به عنوان پدر پیوند کبد در ایران شناخته می‌شود. ملک‌حسینی انجام‌دهنده نخستین پیوند کبد در ایران، نخستین پیوند کبد از فرد زنده به فرد زنده در ایران و نخستین پیوند از یک کبد به دو نفر و همچنین بنیانگذار بخش پیوند اعضا بیمارستان نمازی و بیمارستان پیوند اعضا ابوعلی سینا است.",
  },
  {
    id: "fig2",
    title: "مجید سمیعی",
    image: "samie.jpg",
    face: "چهره های ماندگار: پزشکی و علوم تجربی",
    birthday: "روز تولد: 1316/3/29",

    description:
      "پزشک و جراح مغز و اعصاب ایرانی است. او در حال حاضر ریاست بیمارستان خصوصی علوم عصبی هانوفر در آلمان را بر عهده دارد که خود بنیان‌گذار آن بوده‌است.",
    isFeatured: true,
  },
  {
    id: "fig6",
    title: "باقر آیت‌الله‌زاده شیرازی",
    image: "shirazi.jpg",
    face: "چهره های ماندگار: مهندسی",
    birthday: "روز تولد: 1315/6/1",
    description:
      "معمار، مرمت‌گر، استاد دانشگاه، چهره ماندگار عرصه معماری، حفاظت و مرمت بناهای تاریخی ایران و عضو پیوسته فرهنگستان هنر جمهوری اسلامی ایران بود.او به عنوان بنیان‌گذار مرمت علمی بناها، محوطه‌ها و بافت‌های تاریخی در ایران و از بنیان‌گذاران سازمان میراث فرهنگی کشور شناخته میشود.",
  },
  {
    id: "fig5",
    title: "مرتضی سهرابی",
    image: "sohrabi.jpg",
    face: "چهره های ماندگار: مهندسی",
    birthday: "روز تولد: 1324/4/15",
    dead: "",
    description:
      "استاد مهندسی شیمی و به عنوان چهرهٔ ماندگار رشتهٔ مهندسی شیمی در سال ۱۳۸۰ برگزیده شد. دکتر مرتضی سهرابی از اعضای پیوسته فرهنگستان علوم جمهوری اسلامی ایران بود.",
  },
  {
    id: "fig3",
    title: "محمدحسین ماندگار",
    image: "figure3.jpg",
    description:
      "دکتر ماندگار از چهره های ماندگار مهارت در جراحی پیوند قلب را در سال‌های متمادی و در شهرهای مختلف دنیا به‌دست آورد.وی این دوره را ابتدا در سال۱۹۸۸ درلوزان، سپس در سال۱۹۹۰ در پاریس و بعد در سال ۱۹۹۱ در لندنو در نهایت در سال ۱۹۹۲ در وین گذراند",
    isFeatured: true,
  },
  {
    id: "fig4",
    title: "سید محمود دعایی",
    birthday: "روز تولد: 1320/1/30",
    knowledge: "تحصیلات: حوزه علمیه قم",
    image: "figure1.jpg",
    description:
      "اصغر صوفی: نه در حرف و شعار که در عمل به ملزومات میانه‌روی، عقلانیت و اعتدال پایبند است؛نامش با روزنامه «اطلاعات» پیوند خورده است و نام این روزنامه هم با نام وی. سیدمحمود دعایی،بهترین توصیف را درباره خود بیان می‌کند: «من دیرپاترین مسئولی هستم که در این نظام تمل شدم.",
    isFeatured: false,
  },
];
export function getFiguere() {
  return DUMMY_DATA.filter((figure) => figure.isFeatured);
}
export function getAllFigures() {
  return DUMMY_DATA;
}
export function getFacesById(id) {
  return DUMMY_DATA.find((face) => face.id === id);
}
export function getFilteredFaces() {
  DUMMY_DATA.map((el) => ({ title: el.title, face: el.face }));
}
